# PANDAS

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\jayes\anaconda3\lib\site-packages (1.5.3)
Requirement already satisfied: python-dateutil>=2.8.1 in c:\users\jayes\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayes\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: numpy>=1.21.0 in c:\users\jayes\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\jayes\anaconda3\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [2]:
import pandas as pd
import numpy as np

In [3]:
pd.__version__

'2.1.4'

## PANDAS SERIES

pandas series is a 1-D labelled array capable of holding Data of any type (int,str,python,objects,etc.).this axis labels are collectively called as index

### CREATING SERIES

##### SERIES THROUGH LIST

In [4]:
lst=[1,2,3,4,5]
print(type(lst))
lst=pd.Series(lst)
print(type(lst))

<class 'list'>
<class 'pandas.core.series.Series'>

#### SERIES THROUGH NUMPY ARRAY

In [5]:
arr=np.array([1,2,3,4])
pd.Series(arr)

0    1
1    2
2    3
3    4
dtype: int32

#### GIVING INDEX FOR OUR OWN NEED

In [6]:
pd.Series(index = ['Eshant','Pranjal','Jayesh'],data=[1,2,3])

Eshant     1
Pranjal    2
Jayesh     3
dtype: int64

#### SERIES THROUGH DICTIONARY VALUES

In [7]:
steps = {'day1':4000,'day2':3000,'day3':12000,'day4':9000}
pd.Series(steps)

day1     4000
day2     3000
day3    12000
day4     9000
dtype: int64

#### USING REPEAT FUNTION ALONG WITH CREATING A SERIES

In [8]:
pd.Series(5).repeat(3)

0    5
0    5
0    5
dtype: int64

#### Reset function to make index accurate

In [9]:
pd.Series(5).repeat(3).reset_index()#returns df

   index  0
0      0  5
1      0  5
2      0  5

In [10]:
pd.Series(5).repeat(3).reset_index(drop=True)

0    5
1    5
2    5
dtype: int64

In [11]:
# 10 should be repeated 5 times and 20 should be repeated 2 times
s=pd.Series([10,20]).repeat([5,2]).reset_index(drop=True)#for returning series
s

0    10
1    10
2    10
3    10
4    10
5    20
6    20
dtype: int64

####  accesing element

In [12]:
s[4]

10

#### slicing series

In [13]:
s[2:4]

2    10
3    10
dtype: int64

#### Aggregate function on pandas series :-performing various operations on same series at a time

In [14]:
s=pd.Series([1,2,3,4,5,6,7])
s.agg([min,max,sum])

C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2615412197.py:2: FutureWarning: The provided callable <built-in function min> is currently using Series.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  s.agg([min,max,sum])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2615412197.py:2: FutureWarning: The provided callable <built-in function max> is currently using Series.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  s.agg([min,max,sum])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2615412197.py:2: FutureWarning: The provided callable <built-in function sum> is currently using Series.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  s.agg([min,max,sum])

min     1
max     7
sum    28
dtype: int64

#### series absolute functions:-it returns the absolute value i.e positive of the each elements

In [15]:
sr=pd.Series([1,2,3,4,-5,-7,2])
sr.abs()

0    1
1    2
2    3
3    4
4    5
5    7
6    2
dtype: int64

#### Appending Series (not working in this version dont know why)

In [16]:
sr1=pd.Series([1,-2,3])
sr2=pd.Series([1,2,3])

In [17]:
result=pd.concat([sr1,sr2])

In [18]:
result

0    1
1   -2
2    3
0    1
1    2
2    3
dtype: int64

#### Astype function : use to change the dtype

In [19]:
sr1

0    1
1   -2
2    3
dtype: int64

In [20]:
type(sr1)

pandas.core.series.Series

In [21]:
type(sr1[0])

numpy.int64

In [22]:
sr1.astype(float)

0    1.0
1   -2.0
2    3.0
dtype: float64

#### Between function

In [23]:
sr1=pd.Series([1,2,3,4,5,6,7,8,9,10])
sr1.between(4,7)

0    False
1    False
2    False
3     True
4     True
5     True
6     True
7    False
8    False
9    False
dtype: bool

### All string functions can be used to extract or modify texts in series

In [24]:
sr=pd.Series(['Jayesh Nikumbh','Data Science','Geeks for Geeks','Hello world','Machine Learning'])

##### UPPER AND LOWER FUNCTION

In [25]:
print(sr.str.upper())
print('-'*30)
print(sr.str.lower())

0      JAYESH NIKUMBH
1        DATA SCIENCE
2     GEEKS FOR GEEKS
3         HELLO WORLD
4    MACHINE LEARNING
dtype: object
------------------------------
0      jayesh nikumbh
1        data science
2     geeks for geeks
3         hello world
4    machine learning
dtype: object

#### LENGTH FUNCTION

In [26]:
for i in sr:
    print(len(i))

14
12
15
11
16

##### STRIP FUNCTION :- strip() method removes any leading, and trailing whitespaces.

In [27]:
sr=pd.Series(['    Jayesh Nikumbh','Data Science','Geeks for Geeks','Hello world','Machine Learning'])
for i in sr:
    print(i,len(i))

    Jayesh Nikumbh 18
Data Science 12
Geeks for Geeks 15
Hello world 11
Machine Learning 16

In [28]:
sr=sr.str.strip()
for i in sr:
    print(i,len(i))

Jayesh Nikumbh 14
Data Science 12
Geeks for Geeks 15
Hello world 11
Machine Learning 16

#### SPLIT FUNCTIONS

In [29]:
sr=pd.Series(['Jayesh Nikumbh','Data Science','Geeks for Geeks','Hello world','Machine Learning'])

In [30]:
print(sr.str.split()[0][0])
print(sr.str.split()[0][1])
print(sr.str.split()[1])
print(sr.str.split()[2])

Jayesh
Nikumbh
['Data', 'Science']
['Geeks', 'for', 'Geeks']

In [31]:
print(pd.Series(['10/12/2003','23/10/2006','22/2/2004']).str.split('/')[0])
print(pd.Series(['10/12/2003','23/10/2006','22/2/2004']).str.split('/')[1])
print(pd.Series(['10/12/2003','23/10/2006','22/2/2004']).str.split('/')[2])

['10', '12', '2003']
['23', '10', '2006']
['22', '2', '2004']

#### CONTAINS FUNCTION

In [32]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr.str.contains('@')

0    False
1     True
2    False
3     True
4    False
dtype: bool

#### REPLACE FUNCTION

In [33]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr=sr.str.replace('@',' ')
sr

0      Jayesh Nikumbh
1        Data Science
2     Geeks for Geeks
3         Hello world
4    Machine Learning
dtype: object

#### ENDSWITH AND STARTSWITH

In [34]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr.str.startswith('J')

0     True
1    False
2    False
3    False
4    False
dtype: bool

In [35]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr.str.endswith('s')

0    False
1    False
2     True
3    False
4    False
dtype: bool

#### FIND FUNCTION

In [36]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr.str.find('Geeks')

0   -1
1   -1
2    0
3   -1
4   -1
dtype: int64

#### CONVERTING SERIES INTO LIST

In [37]:
sr=pd.Series(['Jayesh Nikumbh','Data@Science','Geeks for Geeks','Hello@world','Machine Learning'])
sr.to_list()

['Jayesh Nikumbh',
 'Data@Science',
 'Geeks for Geeks',
 'Hello@world',
 'Machine Learning']

## DATAFRAME

it is a 2-D size mutable ,potentially heterogeneous tabular DS with labelled axes(rows and columns)

it consist of 3-principles :- components , rows , columns

In [38]:
lst=['Geeks','for','Geeks','is','portal','for','Geeks']

df=pd.DataFrame(lst)
print(type(df))
df

<class 'pandas.core.frame.DataFrame'>

        0
0   Geeks
1     for
2   Geeks
3      is
4  portal
5     for
6   Geeks

In [39]:
lst=[['jayesh',19],['keshavi',20],['Om',21]]
pd.DataFrame(lst)

         0   1
0   jayesh  19
1  keshavi  20
2       Om  21

In [40]:
data={'Name'        :['Jay','Keshavi','Om'],
     'Age'          :[19,20,21],
     'Address'      :['Delhi','Kanpur','Allahabad'],
     'qualification':['BTech','MS','BTEch']}
df=pd.DataFrame(data)
df

      Name  Age    Address qualification
0      Jay   19      Delhi         BTech
1  Keshavi   20     Kanpur            MS
2       Om   21  Allahabad         BTEch

In [41]:
df[['Name','Age']]

      Name  Age
0      Jay   19
1  Keshavi   20
2       Om   21

#### SLICING

In [42]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}
df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

#### SLICING OF DF USING LOC AND ILOC METHOD

##### LOC

loc : The loc() function is label based data selecting method which means that we have to pass the name of the row or column which we want to select.

In [43]:
df.loc[1:4]

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [44]:
df.loc[:3]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [45]:
df.loc[1:4,'two':'three']

   two  three
1   20    200
2   30    300
3   40    400

##### ILOC

The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to select a specific row/column.

In [46]:
df.iloc[1:3]

   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000

In [47]:
df.iloc[2:3,0:1]

   one
2    3

In [48]:
#selecting specific column
df.iloc[:,2:3]

   three
0    100
1    200
2    300
3    400

In [49]:
#selecting specific rows
df.iloc[2:3,:]

   one  two  three  four
2    3   30    300  3000

In [50]:
df.iloc[[2,3],[0,3]]

   one  four
2    3  3000
3    4  4000

#### Slicing using conditions

In [51]:
df.loc[df['two'] > 20,['three','four']]

   three  four
2    300  3000
3    400  4000

In [52]:
df.loc[df['three']>300,['one','two']]

   one  two
3    4   40

### COLUMN ADDITION IN DF

##### using list

In [53]:
l=[22,33,44,55]
df['five']=l
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

##### using list

In [54]:
sr=pd.Series([111,222,333,444])
df['six']=sr
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

#### using an existing colum

In [55]:
df['seven']=df['two']+2000

In [56]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111   2010
1    2   20    200  2000    33  222   2020
2    3   30    300  3000    44  333   2030
3    4   40    400  4000    55  444   2040

### COLUMN DELETION IN DF

In [57]:
df

   one  two  three  four  five  six  seven
0    1   10    100  1000    22  111   2010
1    2   20    200  2000    33  222   2020
2    3   30    300  3000    44  333   2030
3    4   40    400  4000    55  444   2040

#### using del

In [58]:
del df['seven']

In [59]:
df

   one  two  three  four  five  six
0    1   10    100  1000    22  111
1    2   20    200  2000    33  222
2    3   30    300  3000    44  333
3    4   40    400  4000    55  444

#### using pop

In [60]:
df.pop('six')
df

   one  two  three  four  five
0    1   10    100  1000    22
1    2   20    200  2000    33
2    3   30    300  3000    44
3    4   40    400  4000    55

### ADDITION ON ROWS

In [61]:
df1=pd.DataFrame([[1,2],[3,4]],columns=['a','b'])
df2=pd.DataFrame([[4,5],[6,7]],columns=['a','b'])

In [62]:
df1

   a  b
0  1  2
1  3  4

In [63]:
df2

   a  b
0  4  5
1  6  7

In [64]:
df3=pd.concat([df1,df2]).reset_index()

In [65]:
df3

   index  a  b
0      0  1  2
1      1  3  4
2      0  4  5
3      1  6  7

### PANDAS DROP FUNCTION

AXIS=0 => ROWS

AXIS=1 => COLUMNS

In [66]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [67]:
df.drop([0,1],axis=0,inplace=True)
df

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

In [68]:
df.drop(['three','four'],axis=1,inplace=True)
df

   one  two
2    3   30
3    4   40

### TRANSPOSING THE DF

In [69]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [70]:
df.T

          0     1     2     3
one       1     2     3     4
two      10    20    30    40
three   100   200   300   400
four   1000  2000  3000  4000

### A SET OF MORE DF FUNCTIONALITIES

In [71]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

1) axes function : returns list with the rows and column labels of the df

In [72]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

2) ndim function : returns number dim of df

In [73]:
df.ndim

2

3) dtype : returns type of data

In [74]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

4) shape :returns shape

In [75]:
df.shape

(4, 4)

5) head

In [76]:
df.head(2)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000

6) Tail

In [77]:
df.tail(2)

   one  two  three  four
2    3   30    300  3000
3    4   40    400  4000

7) empty function

In [78]:
df.empty

False

In [79]:
df=pd.DataFrame()
df.empty

True

### STATISTICAL OR MATHEMATICAL FUNCTIONS

In [80]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

1) SUM

In [81]:
df.sum()

one         10
two        100
three     1000
four     10000
dtype: int64

2) MEAN

In [82]:
df.mean()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

3)median

In [83]:
df.median()

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

4)Mode

In [84]:
df.mode()

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

5) variane

In [85]:
df.var()

one      1.666667e+00
two      1.666667e+02
three    1.666667e+04
four     1.666667e+06
dtype: float64

6) std dev

In [86]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1290.994449
dtype: float64

7) Min

In [87]:
df.min()

one         1
two        10
three     100
four     1000
dtype: int64

8)max

In [88]:
df.max()

one         4
two        40
three     400
four     4000
dtype: int64

### DESCRIBE FUNCTION

In [89]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [90]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  2500.000000
std    1.290994  12.909944  129.099445  1290.994449
min    1.000000  10.000000  100.000000  1000.000000
25%    1.750000  17.500000  175.000000  1750.000000
50%    2.500000  25.000000  250.000000  2500.000000
75%    3.250000  32.500000  325.000000  3250.000000
max    4.000000  40.000000  400.000000  4000.000000

### PIPE FUNCTION

1) Pipe function :- allows you to apply a function to the DataFrame

In [91]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [92]:
def add_(i,j):
    return i+j
def sub_(i,j):
    return i-j

In [93]:
df.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410  4010

In [94]:
def mean(col):
    return col.mean()
def square(i):
    return i**2
df.pipe(mean).pipe(square) # we are getting mean square using pipe function here

one            6.25
two          625.00
three      62500.00
four     6250000.00
dtype: float64

2) apply function : apply function allow us to apply function to the DF

In [95]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

In [96]:
print(df.apply(np.mean))

one         2.5
two        25.0
three     250.0
four     2500.0
dtype: float64

In [97]:
print(df.apply(np.max))

one         4
two        40
three     400
four     4000
dtype: int64

In [98]:
print(df.apply(np.min))

one         1
two        10
three     100
four     1000
dtype: int64

In [99]:
df.apply(lambda x: x.max() - x.min() )

one         3
two        30
three     300
four     3000
dtype: int64

3) applymap is use to apply function on each element of the df

In [100]:
df.applymap(lambda x: x*100)

C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\3727459468.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(lambda x: x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000  400000

In [101]:
df=pd.DataFrame({'A':[1.2,3.2,4.3],
               'B':[4.3,3.2,2.1]})
df.applymap(np.int64)

C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2116109314.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(np.int64)

   A  B
0  1  4
1  3  3
2  4  2

##### apply and applymap function

In [102]:
df=pd.DataFrame({'A':[1.2,3.2,4.3],
               'B':[4.3,3.2,2.1]})
df1=df.applymap(np.int64)
print(df1)

df2=df.apply(lambda row: row.mean(),axis=1)
df2

   A  B
0  1  4
1  3  3
2  4  2

C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\539191800.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df1=df.applymap(np.int64)

0    2.75
1    3.20
2    3.20
dtype: float64

### Reindex functions : it is used to change the lable of rows or columns of df

##### ROWS

In [103]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
print(df)
print('-'*20)
print(df.reindex([1,2,0,3]))

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
--------------------
   one  two  three  four
1    2   20    200  2000
2    3   30    300  3000
0    1   10    100  1000
3    4   40    400  4000

In [104]:
data={'Name'        :['Jay','Keshavi','Om'],
     'Age'          :[19,20,21],
     'Address'      :['Delhi','Kanpur','Allahabad'],
     'qualification':['BTech','MS','BTEch']}
df=pd.DataFrame(data)
print(df)
print('-'*20)
print(df.reindex(columns=['Name','Address','qualification','Age']))

      Name  Age    Address qualification
0      Jay   19      Delhi         BTech
1  Keshavi   20     Kanpur            MS
2       Om   21  Allahabad         BTEch
--------------------
      Name    Address qualification  Age
0      Jay      Delhi         BTech   19
1  Keshavi     Kanpur            MS   20
2       Om  Allahabad         BTEch   21

### RENAMING COLUMNS IN PANDAS

In [105]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)
print('-'*30)
print('Data before renaming')
print('-'*30)
print(df)
print('-'*30)
df.rename(columns={'one':'One','two':'Two','three':'Three','four':'Four'},inplace=True,index={0:'a',1:'b',2:'c',3:'d'})
print('Data after renaming')
print('-'*30)
print(df)

------------------------------
Data before renaming
------------------------------
   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000
------------------------------
Data after renaming
------------------------------
   One  Two  Three  Four
a    1   10    100  1000
b    2   20    200  2000
c    3   30    300  3000
d    4   40    400  4000

### SORTING IN PANDAS DF

In [106]:
data={'one' : pd.Series([1,20,18,4]),
     'two': pd.Series([8,2,3,4]),
     'three':pd.Series([10,12,8,4]),
     'four': pd.Series([7,21,3,9])}

df=pd.DataFrame(data)
df

   one  two  three  four
0    1    8     10     7
1   20    2     12    21
2   18    3      8     3
3    4    4      4     9

1) sort in specific column

In [107]:
df.sort_values(by='one')

   one  two  three  four
0    1    8     10     7
3    4    4      4     9
2   18    3      8     3
1   20    2     12    21

2) Sort in specific order

In [108]:
df.sort_values(by='one',ascending=False)

   one  two  three  four
1   20    2     12    21
2   18    3      8     3
3    4    4      4     9
0    1    8     10     7

3) sort with specific order base on multiple columns

In [109]:
df.sort_values(by=['one','three'])

   one  two  three  four
0    1    8     10     7
3    4    4      4     9
2   18    3      8     3
1   20    2     12    21

4) sort with specific sorting algo.

.quicksort

.mergesort

.heapsort

### GROUPBY FUNCTION :-used to split a df into groups based on one or more columns.

In [110]:
data = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df=pd.DataFrame(data)
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

In [111]:
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

To search

In [112]:
df.groupby(['Name','Age']).get_group(('Jai',22))

  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

Adding some statistical computation on top of groupby

In [113]:
df.groupby('Name')['Address'].count().sort_values()

Name
Abhi      1
Gaurav    1
Anuj      2
Jai       2
Princi    2
Name: Address, dtype: int64

check multiple stats

In [114]:
groups=df.groupby('Name')
groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])

C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2105625134.py:2: FutureWarning: The provided callable <function mean at 0x000001BFAE7AACA0> is currently using SeriesGroupBy.mean. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "mean" instead.
  groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2105625134.py:2: FutureWarning: The provided callable <function std at 0x000001BFAE7AAE80> is currently using SeriesGroupBy.std. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "std" instead.
  groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2105625134.py:2: FutureWarning: The provided callable <function var at 0x000001BFAE7AB060> is currently using SeriesGroupBy.var. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "var" instead.
  groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2105625134.py:2: FutureWarning: The provided callable <function amin at 0x000001BFAE7AA160> is currently using SeriesGroupBy.min. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "min" instead.
  groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])
C:\Users\jayes\AppData\Local\Temp\ipykernel_5776\2105625134.py:2: FutureWarning: The provided callable <function amax at 0x000001BFAE7A9F80> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  groups['Age'].agg([np.mean,np.std,np.var,np.min,np.max])

        mean       std   var  amin  amax
Name
Abhi    32.0       NaN   NaN    32    32
Anuj    30.0  8.485281  72.0    24    36
Gaurav  33.0       NaN   NaN    33    33
Jai     24.5  3.535534  12.5    22    27
Princi  29.5  3.535534  12.5    27    32

In [115]:
df.groupby('Name').filter(lambda x: len(x) == 2)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc

# BASIC DATA ANALYSIS USING PANDAS

In [136]:
df=pd.read_csv(r"C:\DAP\used_cars_data.csv")
df

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [117]:
df.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [118]:
df.tail()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   S.No.              7253 non-null   int64
 1   Name               7253 non-null   object
 2   Location           7253 non-null   object
 3   Year               7253 non-null   int64
 4   Kilometers_Driven  7253 non-null   int64
 5   Fuel_Type          7253 non-null   object
 6   Transmission       7253 non-null   object
 7   Owner_Type         7253 non-null   object
 8   Mileage            7251 non-null   object
 9   Engine             7207 non-null   object
 10  Power              7207 non-null   object
 11  Seats              7200 non-null   float64
 12  New_Price          1006 non-null   object
 13  Price              6019 non-null   float64
dtypes: float64(2), int64(3), object(9)
memory usage: 793.4+ KB

In [120]:
df.describe()

             S.No.         Year  Kilometers_Driven        Seats        Price
count  7253.000000  7253.000000       7.253000e+03  7200.000000  6019.000000
mean   3626.000000  2013.365366       5.869906e+04     5.279722     9.479468
std    2093.905084     3.254421       8.442772e+04     0.811660    11.187917
min       0.000000  1996.000000       1.710000e+02     0.000000     0.440000
25%    1813.000000  2011.000000       3.400000e+04     5.000000     3.500000
50%    3626.000000  2014.000000       5.341600e+04     5.000000     5.640000
75%    5439.000000  2016.000000       7.300000e+04     5.000000     9.950000
max    7252.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [121]:
df.isnull().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                1234
dtype: int64

#### QUANTILE FUNCITON TO GET SPECIFIC PERCENTILE

In [122]:
df.describe(percentiles = [.80])

             S.No.         Year  Kilometers_Driven        Seats        Price
count  7253.000000  7253.000000       7.253000e+03  7200.000000  6019.000000
mean   3626.000000  2013.365366       5.869906e+04     5.279722     9.479468
std    2093.905084     3.254421       8.442772e+04     0.811660    11.187917
min       0.000000  1996.000000       1.710000e+02     0.000000     0.440000
50%    3626.000000  2014.000000       5.341600e+04     5.000000     5.640000
80%    5801.600000  2016.000000       7.900000e+04     5.000000    12.500000
max    7252.000000  2019.000000       6.500000e+06    10.000000   160.000000

In [123]:
df['Seats'].quantile(.80)

5.0

Quantiles are specific points in a data set that partition the data into intervals of equal probability. These points are used to understand the spread and distribution of the data.

The most common quantiles are:

Quartiles: Divide the data into 4 equal parts

Quintiles: Divide the data into 5 equal parts

Percentiles divide a dataset into 100 equal parts. The nth percentile represents the value below which n percent of the data falls. For instance, the 50th percentile (also known as the median) is the value below which 50% of the data lies

In [124]:
df['Kilometers_Driven'].quantile(.99)

173479.99999999956

#### COPY fucntion

In [125]:
de=df.copy()
de.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [126]:
de['Seats+1']=de['Seats']+1
de.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price,Seats+1
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75,6.0
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50,6.0
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50,6.0
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00,8.0
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74,6.0

#### VALUE COUNTS

In [127]:
df['Location'].value_counts()

Location
Mumbai        949
Hyderabad     876
Coimbatore    772
Kochi         772
Pune          765
Delhi         660
Kolkata       654
Chennai       591
Jaipur        499
Bangalore     440
Ahmedabad     275
Name: count, dtype: int64

#### unique and nunique functions

In [128]:
df['Owner_Type'].unique()

array(['First', 'Second', 'Fourth & Above', 'Third'], dtype=object)

In [129]:
df['Owner_Type'].nunique()

4

#### dropna function

In [130]:
df.isnull().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                1234
dtype: int64

In [131]:
df.shape

(7253, 14)

In [133]:
# to drop the null values row wise
df.dropna(inplace=True,axis=0)

In [135]:
df

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
7,7,Toyota Innova Crysta 2.8 GX AT 8S,Mumbai,2016,36000,Diesel,Automatic,First,11.36 kmpl,2755 CC,171.5 bhp,8.0,21 Lakh,17.50
10,10,Maruti Ciaz Zeta,Kochi,2018,25692,Petrol,Manual,First,21.56 kmpl,1462 CC,103.25 bhp,5.0,10.65 Lakh,9.95
15,15,Mitsubishi Pajero Sport 4X4,Delhi,2014,110000,Diesel,Manual,First,13.5 kmpl,2477 CC,175.56 bhp,7.0,32.01 Lakh,15.00
20,20,BMW 3 Series 320d,Kochi,2014,32982,Diesel,Automatic,First,22.69 kmpl,1995 CC,190 bhp,5.0,47.87 Lakh,18.55
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5999,5999,Tata Bolt Revotron XT,Chennai,2016,10000,Petrol,Manual,First,17.57 kmpl,1193 CC,88.7 bhp,5.0,7.77 Lakh,4.00
6002,6002,Volkswagen Vento 1.6 Highline,Mumbai,2011,38000,Petrol,Manual,First,16.09 kmpl,1598 CC,103.5 bhp,5.0,11.91 Lakh,3.25
6005,6005,Maruti Vitara Brezza VDi,Pune,2016,37208,Diesel,Manual,First,24.3 kmpl,1248 CC,88.5 bhp,5.0,9.93 Lakh,7.43
6010,6010,Honda Brio 1.2 VX MT,Delhi,2013,33746,Petrol,Manual,First,18.5 kmpl,1198 CC,86.8 bhp,5.0,6.63 Lakh,3.20
6014,6014,Maruti Swift VDI,Delhi,2014,27365,Diesel,Manual,First,28.4 kmpl,1248 CC,74 bhp,5.0,7.88 Lakh,4.75

In [134]:
df.shape

(823, 14)

In [137]:
# to drop the null values column wise
df.dropna(inplace=True,axis=1)

In [138]:
df.shape

(7253, 8)

#### fillna Function

In [140]:
df=pd.read_csv(r"C:\DAP\used_cars_data.csv")
df.head()

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74

In [141]:
df.isnull().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                1234
dtype: int64

In [153]:
mis=round(df['Price'].mean(),2)
df['Price'].fillna(mis,inplace=True)
df.isnull().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 2
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                   0
dtype: int64

In [161]:
# categorical column
mis2=df['Mileage'].mode()
df['Mileage'].fillna(mis2[0],inplace=True)
df.isnull().sum()

S.No.                   0
Name                    0
Location                0
Year                    0
Kilometers_Driven       0
Fuel_Type               0
Transmission            0
Owner_Type              0
Mileage                 0
Engine                 46
Power                  46
Seats                  53
New_Price            6247
Price                   0
dtype: int64

### sample function

In [167]:
df.sample(5)

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
6931,6931,Volkswagen Vento Diesel Trendline,Ahmedabad,2013,79003,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,9.48
3087,3087,BMW 3 Series 320d,Coimbatore,2013,85846,Diesel,Automatic,First,22.69 kmpl,1995 CC,190 bhp,5.0,48.79 Lakh,13.08
5800,5800,Toyota Innova 2.5 VX (Diesel) 7 Seater BS IV,Hyderabad,2012,210000,Diesel,Manual,First,12.99 kmpl,2494 CC,100 bhp,7.0,NaN,9.00
3505,3505,Fiat Punto EVO 1.2 Emotion,Hyderabad,2010,59270,Petrol,Manual,First,15.7 kmpl,1172 CC,67 bhp,5.0,NaN,2.60
5231,5231,Hyundai i20 Asta Optional with Sunroof 1.2,Kochi,2013,62132,Petrol,Manual,First,18.5 kmpl,1197 CC,82.85 bhp,5.0,NaN,4.57

### to_csv() function

In [169]:
data={'one' : pd.Series([1,2,3,4]),
     'two': pd.Series([10,20,30,40]),
     'three':pd.Series([100,200,300,400]),
     'four': pd.Series([1000,2000,3000,4000])}

df=pd.DataFrame(data)

df.to_csv('Number.csv')

In [170]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400  4000

# Pandas Profile Report`

In [172]:
!pip install pandas_profiling

Requirement already satisfied: pandas_profiling in c:\users\jayes\anaconda3\lib\site-packages (1.4.1)
Requirement already satisfied: pandas>=0.19 in c:\users\jayes\anaconda3\lib\site-packages (from pandas_profiling) (1.5.3)
Requirement already satisfied: matplotlib>=1.4 in c:\users\jayes\anaconda3\lib\site-packages (from pandas_profiling) (3.7.2)
Requirement already satisfied: jinja2>=2.8 in c:\users\jayes\anaconda3\lib\site-packages (from pandas_profiling) (3.1.2)
Requirement already satisfied: six>=1.9 in c:\users\jayes\anaconda3\lib\site-packages (from pandas_profiling) (1.16.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\jayes\anaconda3\lib\site-packages (from jinja2>=2.8->pandas_profiling) (2.1.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (1.4.4)
Requirement already satisfied: numpy>=1.20 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (1.24.3)
Requirement already satisfied: packaging>=20.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (9.4.0)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas_profiling) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayes\anaconda3\lib\site-packages (from pandas>=0.19->pandas_profiling) (2023.3.post1)

In [176]:
df=pd.read_csv(r"C:\DAP\used_cars_data.csv")
df

,S.No.,Name,Location,Year,Kilometers_Driven,Fuel_Type,Transmission,Owner_Type,Mileage,Engine,Power,Seats,New_Price,Price
0,0,Maruti Wagon R LXI CNG,Mumbai,2010,72000,CNG,Manual,First,26.6 km/kg,998 CC,58.16 bhp,5.0,NaN,1.75
1,1,Hyundai Creta 1.6 CRDi SX Option,Pune,2015,41000,Diesel,Manual,First,19.67 kmpl,1582 CC,126.2 bhp,5.0,NaN,12.50
2,2,Honda Jazz V,Chennai,2011,46000,Petrol,Manual,First,18.2 kmpl,1199 CC,88.7 bhp,5.0,8.61 Lakh,4.50
3,3,Maruti Ertiga VDI,Chennai,2012,87000,Diesel,Manual,First,20.77 kmpl,1248 CC,88.76 bhp,7.0,NaN,6.00
4,4,Audi A4 New 2.0 TDI Multitronic,Coimbatore,2013,40670,Diesel,Automatic,Second,15.2 kmpl,1968 CC,140.8 bhp,5.0,NaN,17.74
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,7248,Volkswagen Vento Diesel Trendline,Hyderabad,2011,89411,Diesel,Manual,First,20.54 kmpl,1598 CC,103.6 bhp,5.0,NaN,NaN
7249,7249,Volkswagen Polo GT TSI,Mumbai,2015,59000,Petrol,Automatic,First,17.21 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7250,7250,Nissan Micra Diesel XV,Kolkata,2012,28000,Diesel,Manual,First,23.08 kmpl,1461 CC,63.1 bhp,5.0,NaN,NaN
7251,7251,Volkswagen Polo GT TSI,Pune,2013,52262,Petrol,Automatic,Third,17.2 kmpl,1197 CC,103.6 bhp,5.0,NaN,NaN
7252,7252,Mercedes-Benz E-Class 2009-2013 E 220 CDI Avan...,Kochi,2014,72443,Diesel,Automatic,First,10.0 kmpl,2148 CC,170 bhp,5.0,NaN,NaN

In [177]:
report=pandas_profiling.ProfileReport(df)

NameError: name 'pandas_profiling' is not defined

In [178]:
import pandas_profiling as pp

ImportError: cannot import name 'DataError' from 'pandas.core.base' (C:\Users\jayes\anaconda3\Lib\site-packages\pandas\core\base.py)

In [179]:
pip install pandas-profiling

Requirement already satisfied: pandas-profiling in c:\users\jayes\anaconda3\lib\site-packages (1.4.1)
Requirement already satisfied: pandas>=0.19 in c:\users\jayes\anaconda3\lib\site-packages (from pandas-profiling) (1.5.3)
Requirement already satisfied: matplotlib>=1.4 in c:\users\jayes\anaconda3\lib\site-packages (from pandas-profiling) (3.7.2)
Requirement already satisfied: jinja2>=2.8 in c:\users\jayes\anaconda3\lib\site-packages (from pandas-profiling) (3.1.2)
Requirement already satisfied: six>=1.9 in c:\users\jayes\anaconda3\lib\site-packages (from pandas-profiling) (1.16.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\jayes\anaconda3\lib\site-packages (from jinja2>=2.8->pandas-profiling) (2.1.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (1.4.4)
Requirement already satisfied: numpy>=1.20 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (1.24.3)
Requirement already satisfied: packaging>=20.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (23.1)
Requirement already satisfied: pillow>=6.2.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (9.4.0)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib>=1.4->pandas-profiling) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayes\anaconda3\lib\site-packages (from pandas>=0.19->pandas-profiling) (2023.3.post1)
Note: you may need to restart the kernel to use updated packages.

In [181]:
import pandas as pd
from pandas_profiling import ProfileReport

ImportError: cannot import name 'DataError' from 'pandas.core.base' (C:\Users\jayes\anaconda3\Lib\site-packages\pandas\core\base.py)

In [182]:
pip install ydata-profiling

Collecting ydata-profiling
  Obtaining dependency information for ydata-profiling from https://files.pythonhosted.org/packages/5f/35/d4a9e004206c217bfe8838a37663c1b53769ab839e853c4c250b73968cea/ydata_profiling-4.9.0-py2.py3-none-any.whl.metadata
  Downloading ydata_profiling-4.9.0-py2.py3-none-any.whl.metadata (20 kB)
Requirement already satisfied: scipy<1.14,>=1.4.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (1.11.1)
Requirement already satisfied: pandas!=1.4.0,<3,>1.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (1.5.3)
Requirement already satisfied: matplotlib<3.10,>=3.5 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (3.7.2)
Collecting pydantic>=2 (from ydata-profiling)
  Obtaining dependency information for pydantic>=2 from https://files.pythonhosted.org/packages/1f/fa/b7f815b8c9ad021c07f88875b601222ef5e70619391ade4a49234d12d278/pydantic-2.8.2-py3-none-any.whl.metadata
  Downloading pydantic-2.8.2-py3-none-any.whl.metadata (125 kB)
     ---------------------------------------- 0.0/125.2 kB ? eta -:--:--
     --------- ----------------------------- 30.7/125.2 kB 1.3 MB/s eta 0:00:01
     -------------------------------------  122.9/125.2 kB 2.4 MB/s eta 0:00:01
     -------------------------------------- 125.2/125.2 kB 1.2 MB/s eta 0:00:00
Requirement already satisfied: PyYAML<6.1,>=5.0.0 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (6.0)
Requirement already satisfied: jinja2<3.2,>=2.11.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (3.1.2)
Collecting visions[type_image_path]<0.7.7,>=0.7.5 (from ydata-profiling)
  Obtaining dependency information for visions[type_image_path]<0.7.7,>=0.7.5 from https://files.pythonhosted.org/packages/7c/bf/612b24e711ae25dea9af19b9304634b8949faa0b035fad47e8bcadf62f59/visions-0.7.6-py3-none-any.whl.metadata
  Downloading visions-0.7.6-py3-none-any.whl.metadata (11 kB)
Requirement already satisfied: numpy<2,>=1.16.0 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (1.24.3)
Requirement already satisfied: htmlmin==0.1.12 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (0.1.12)
Requirement already satisfied: phik<0.13,>=0.11.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (0.12.4)
Requirement already satisfied: requests<3,>=2.24.0 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (2.31.0)
Requirement already satisfied: tqdm<5,>=4.48.2 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (4.65.0)
Requirement already satisfied: seaborn<0.14,>=0.10.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (0.12.2)
Requirement already satisfied: multimethod<2,>=1.4 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (1.11)
Requirement already satisfied: statsmodels<1,>=0.13.2 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (0.14.0)
Collecting typeguard<5,>=3 (from ydata-profiling)
  Obtaining dependency information for typeguard<5,>=3 from https://files.pythonhosted.org/packages/eb/de/be0ba39ee73760bf33329b7c6f95bc67e96593c69c881671e312538e24bb/typeguard-4.3.0-py3-none-any.whl.metadata
  Downloading typeguard-4.3.0-py3-none-any.whl.metadata (3.7 kB)
Requirement already satisfied: imagehash==4.3.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (4.3.1)
Requirement already satisfied: wordcloud>=1.9.1 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (1.9.3)
Collecting dacite>=1.8 (from ydata-profiling)
  Obtaining dependency information for dacite>=1.8 from https://files.pythonhosted.org/packages/21/0f/cf0943f4f55f0fbc7c6bd60caf1343061dff818b02af5a0d444e473bb78d/dacite-1.8.1-py3-none-any.whl.metadata
  Downloading dacite-1.8.1-py3-none-any.whl.metadata (15 kB)
Requirement already satisfied: numba<1,>=0.56.0 in c:\users\jayes\anaconda3\lib\site-packages (from ydata-profiling) (0.57.1)
Requirement already satisfied: PyWavelets in c:\users\jayes\anaconda3\lib\site-packages (from imagehash==4.3.1->ydata-profiling) (1.4.1)
Requirement already satisfied: pillow in c:\users\jayes\anaconda3\lib\site-packages (from imagehash==4.3.1->ydata-profiling) (9.4.0)
Requirement already satisfied: MarkupSafe>=2.0 in c:\users\jayes\anaconda3\lib\site-packages (from jinja2<3.2,>=2.11.1->ydata-profiling) (2.1.1)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (1.0.5)
Requirement already satisfied: cycler>=0.10 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (0.11.0)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (4.25.0)
Requirement already satisfied: kiwisolver>=1.0.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (1.4.4)
Requirement already satisfied: packaging>=20.0 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (23.1)
Requirement already satisfied: pyparsing<3.1,>=2.3.1 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (3.0.9)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\jayes\anaconda3\lib\site-packages (from matplotlib<3.10,>=3.5->ydata-profiling) (2.8.2)
Requirement already satisfied: llvmlite<0.41,>=0.40.0dev0 in c:\users\jayes\anaconda3\lib\site-packages (from numba<1,>=0.56.0->ydata-profiling) (0.40.0)
Requirement already satisfied: pytz>=2020.1 in c:\users\jayes\anaconda3\lib\site-packages (from pandas!=1.4.0,<3,>1.1->ydata-profiling) (2023.3.post1)
Requirement already satisfied: joblib>=0.14.1 in c:\users\jayes\anaconda3\lib\site-packages (from phik<0.13,>=0.11.1->ydata-profiling) (1.4.2)
Collecting annotated-types>=0.4.0 (from pydantic>=2->ydata-profiling)
  Obtaining dependency information for annotated-types>=0.4.0 from https://files.pythonhosted.org/packages/78/b6/6307fbef88d9b5ee7421e68d78a9f162e0da4900bc5f5793f6d3d0e34fb8/annotated_types-0.7.0-py3-none-any.whl.metadata
  Downloading annotated_types-0.7.0-py3-none-any.whl.metadata (15 kB)
Collecting pydantic-core==2.20.1 (from pydantic>=2->ydata-profiling)
  Obtaining dependency information for pydantic-core==2.20.1 from https://files.pythonhosted.org/packages/35/7f/58758c42c61b0bdd585158586fecea295523d49933cb33664ea888162daf/pydantic_core-2.20.1-cp311-none-win_amd64.whl.metadata
  Downloading pydantic_core-2.20.1-cp311-none-win_amd64.whl.metadata (6.7 kB)
Requirement already satisfied: typing-extensions>=4.6.1 in c:\users\jayes\anaconda3\lib\site-packages (from pydantic>=2->ydata-profiling) (4.7.1)
Requirement already satisfied: charset-normalizer<4,>=2 in c:\users\jayes\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling) (2.0.4)
Requirement already satisfied: idna<4,>=2.5 in c:\users\jayes\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling) (3.4)
Requirement already satisfied: urllib3<3,>=1.21.1 in c:\users\jayes\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling) (1.26.16)
Requirement already satisfied: certifi>=2017.4.17 in c:\users\jayes\anaconda3\lib\site-packages (from requests<3,>=2.24.0->ydata-profiling) (2024.2.2)
Requirement already satisfied: patsy>=0.5.2 in c:\users\jayes\anaconda3\lib\site-packages (from statsmodels<1,>=0.13.2->ydata-profiling) (0.5.3)
Requirement already satisfied: colorama in c:\users\jayes\anaconda3\lib\site-packages (from tqdm<5,>=4.48.2->ydata-profiling) (0.4.6)
Collecting typing-extensions>=4.6.1 (from pydantic>=2->ydata-profiling)
  Obtaining dependency information for typing-extensions>=4.6.1 from https://files.pythonhosted.org/packages/26/9f/ad63fc0248c5379346306f8668cda6e2e2e9c95e01216d2b8ffd9ff037d0/typing_extensions-4.12.2-py3-none-any.whl.metadata
  Downloading typing_extensions-4.12.2-py3-none-any.whl.metadata (3.0 kB)
Collecting pandas!=1.4.0,<3,>1.1 (from ydata-profiling)
  Obtaining dependency information for pandas!=1.4.0,<3,>1.1 from https://files.pythonhosted.org/packages/ab/63/966db1321a0ad55df1d1fe51505d2cdae191b84c907974873817b0a6e849/pandas-2.2.2-cp311-cp311-win_amd64.whl.metadata
  Downloading pandas-2.2.2-cp311-cp311-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: attrs>=19.3.0 in c:\users\jayes\anaconda3\lib\site-packages (from visions[type_image_path]<0.7.7,>=0.7.5->ydata-profiling) (22.1.0)
Requirement already satisfied: networkx>=2.4 in c:\users\jayes\anaconda3\lib\site-packages (from visions[type_image_path]<0.7.7,>=0.7.5->ydata-profiling) (3.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\jayes\anaconda3\lib\site-packages (from pandas!=1.4.0,<3,>1.1->ydata-profiling) (2023.3)
Requirement already satisfied: six in c:\users\jayes\anaconda3\lib\site-packages (from patsy>=0.5.2->statsmodels<1,>=0.13.2->ydata-profiling) (1.16.0)
Downloading ydata_profiling-4.9.0-py2.py3-none-any.whl (356 kB)
   ---------------------------------------- 0.0/356.2 kB ? eta -:--:--
   -------------- ------------------------- 133.1/356.2 kB 2.6 MB/s eta 0:00:01
   ---------------------------------------- 356.2/356.2 kB 3.7 MB/s eta 0:00:00
Downloading dacite-1.8.1-py3-none-any.whl (14 kB)
Downloading pydantic-2.8.2-py3-none-any.whl (423 kB)
   ---------------------------------------- 0.0/423.9 kB ? eta -:--:--
   ---------------- ----------------------- 174.1/423.9 kB 5.3 MB/s eta 0:00:01
   ---------------------------------- ----- 368.6/423.9 kB 4.6 MB/s eta 0:00:01
   ---------------------------------------- 423.9/423.9 kB 3.8 MB/s eta 0:00:00
Downloading pydantic_core-2.20.1-cp311-none-win_amd64.whl (1.9 MB)
   ---------------------------------------- 0.0/1.9 MB ? eta -:--:--
   ----- ---------------------------------- 0.2/1.9 MB 7.6 MB/s eta 0:00:01
   ----------- ---------------------------- 0.5/1.9 MB 5.7 MB/s eta 0:00:01
   ------------------ --------------------- 0.9/1.9 MB 7.0 MB/s eta 0:00:01
   -------------------------- ------------- 1.3/1.9 MB 7.3 MB/s eta 0:00:01
   ------------------------------ --------- 1.5/1.9 MB 7.1 MB/s eta 0:00:01
   ----------------------------------- ---- 1.7/1.9 MB 6.3 MB/s eta 0:00:01
   -------------------------------------- - 1.8/1.9 MB 5.8 MB/s eta 0:00:01
   ---------------------------------------- 1.9/1.9 MB 5.5 MB/s eta 0:00:00
Downloading typeguard-4.3.0-py3-none-any.whl (35 kB)
Downloading pandas-2.2.2-cp311-cp311-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   - -------------------------------------- 0.5/11.6 MB 14.4 MB/s eta 0:00:01
   -- ------------------------------------- 0.7/11.6 MB 8.8 MB/s eta 0:00:02
   --- ------------------------------------ 1.0/11.6 MB 7.7 MB/s eta 0:00:02
   ---- ----------------------------------- 1.3/11.6 MB 8.1 MB/s eta 0:00:02
   ----- ---------------------------------- 1.6/11.6 MB 7.9 MB/s eta 0:00:02
   ------ --------------------------------- 2.0/11.6 MB 7.5 MB/s eta 0:00:02
   ------ --------------------------------- 2.0/11.6 MB 7.5 MB/s eta 0:00:02
   -------- ------------------------------- 2.3/11.6 MB 6.8 MB/s eta 0:00:02
   -------- ------------------------------- 2.5/11.6 MB 6.2 MB/s eta 0:00:02
   ---------- ----------------------------- 3.0/11.6 MB 6.6 MB/s eta 0:00:02
   ----------- ---------------------------- 3.3/11.6 MB 6.5 MB/s eta 0:00:02
   ----------- ---------------------------- 3.4/11.6 MB 6.3 MB/s eta 0:00:02
   ------------- -------------------------- 3.9/11.6 MB 6.6 MB/s eta 0:00:02
   -------------- ------------------------- 4.3/11.6 MB 6.6 MB/s eta 0:00:02
   ----------------- ---------------------- 5.0/11.6 MB 7.3 MB/s eta 0:00:01
   ------------------ --------------------- 5.5/11.6 MB 7.6 MB/s eta 0:00:01
   ------------------- -------------------- 5.6/11.6 MB 7.4 MB/s eta 0:00:01
   --------------------- ------------------ 6.2/11.6 MB 7.4 MB/s eta 0:00:01
   ----------------------- ---------------- 6.7/11.6 MB 7.7 MB/s eta 0:00:01
   ------------------------ --------------- 7.1/11.6 MB 7.9 MB/s eta 0:00:01
   -------------------------- ------------- 7.7/11.6 MB 8.0 MB/s eta 0:00:01
   --------------------------- ------------ 7.9/11.6 MB 7.8 MB/s eta 0:00:01
   ----------------------------- ---------- 8.5/11.6 MB 8.0 MB/s eta 0:00:01
   ------------------------------- -------- 9.2/11.6 MB 8.3 MB/s eta 0:00:01
   ---------------------------------- ----- 10.1/11.6 MB 8.7 MB/s eta 0:00:01
   ------------------------------------- -- 10.9/11.6 MB 9.1 MB/s eta 0:00:01
   ---------------------------------------  11.6/11.6 MB 9.9 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 9.3 MB/s eta 0:00:00
Downloading annotated_types-0.7.0-py3-none-any.whl (13 kB)
Downloading typing_extensions-4.12.2-py3-none-any.whl (37 kB)
Downloading visions-0.7.6-py3-none-any.whl (104 kB)
   ---------------------------------------- 0.0/104.8 kB ? eta -:--:--
   ---------------------------------------- 104.8/104.8 kB 6.3 MB/s eta 0:00:00
Installing collected packages: typing-extensions, dacite, annotated-types, typeguard, pydantic-core, pandas, visions, pydantic, ydata-profiling
  Attempting uninstall: typing-extensions
    Found existing installation: typing_extensions 4.7.1
    Uninstalling typing_extensions-4.7.1:
      Successfully uninstalled typing_extensions-4.7.1
  Attempting uninstall: pandas
    Found existing installation: pandas 1.5.3
    Uninstalling pandas-1.5.3:
      Successfully uninstalled pandas-1.5.3
  Attempting uninstall: visions
    Found existing installation: visions 0.7.4
    Uninstalling visions-0.7.4:
      Successfully uninstalled visions-0.7.4
  Attempting uninstall: pydantic
    Found existing installation: pydantic 1.10.8
    Uninstalling pydantic-1.10.8:
      Successfully uninstalled pydantic-1.10.8
Successfully installed annotated-types-0.7.0 dacite-1.8.1 pandas-2.1.4 pydantic-2.8.2 pydantic-core-2.20.1 typeguard-4.3.0 typing-extensions-4.12.2 visions-0.7.6 ydata-profiling-4.9.0
Note: you may need to restart the kernel to use updated packages.

ERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.
anaconda-cloud-auth 0.1.3 requires pydantic<2.0, but you have pydantic 2.8.2 which is incompatible.
autoviz 0.1.808 requires pandas<2.0, but you have pandas 2.2.2 which is incompatible.